app/controllers/usuarios_controller.rb

SELECT `usuario`.* FROM `usuario`
---
  def index
    @usuarios = Usuario.includes(
      :empleado,
      :tipousuario,
      :profesor,
      :rol
    )
    .where("ACTIVO_USUARIO = ?", true)

    @usuarios = @usuarios.where("ACTIVO_ROL = ?", true).references(:rol)

    attributes = Usuario.attribute_names
    params.each do |key, value|